app/controllers/diaries_controller.rb

SELECT  "diaries".* FROM "diaries" WHERE "diaries"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @diaries = current_user.diaries.where(is_published: true).order(:diary_date)

    if current_user.diaries.where(is_published: false).any?

SELECT  "diaries".* FROM "diaries" WHERE "diaries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @diary = current_user.diaries.find_by(id: params[:id])